
from timeit import default_timer as timer;

data_array = [9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20, 9, 99, 1,  103, 4, 8, 8, 6, 7, 990, 12, 4, 44, 55, 77, 88, 11, 9, 53, 20]

# 基数排序
def radix_sort(data):
	# 记录当前正在排拿一位,最低位为1
	i = 0
	# 最大值
	max_num = max(data)
	# 记录最大值的位数
	j = len(str(max_num))
	while i < j:
		# 初始化桶数组
		bucket_list = [[] for _ in range(10)]
		for x in data:
			# 找到位置放入桶数组
			bucket_list[int(x / (10 ** i)) % 10].append(x)
		data.clear()
		# 放回原序列
		for x in bucket_list:
			for y in x:
				data.append(y)
		i += 1

if __name__ == "__main__":

    # 基数排序
    print("排序前:\n",data_array)
    start_time = timer()
    radix_sort(data_array)
    end_time = timer()
    run_time = end_time - start_time
    print("排序后:\n",data_array)
    print (">>> 基数排序运算时间:%.5f秒"%run_time)
    print("=======================================================================")